-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               10.1.21-MariaDB - mariadb.org binary distribution
-- Server OS:                    Win32
-- HeidiSQL Version:             9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Dumping database structure for 3546_3547
CREATE DATABASE IF NOT EXISTS `3546_3547` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `3546_3547`;

-- Dumping structure for table 3546_3547.ingredients
CREATE TABLE IF NOT EXISTS `ingredients` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ingredient` varchar(50) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=latin1;

-- Dumping data for table 3546_3547.ingredients: ~6 rows (approximately)
/*!40000 ALTER TABLE `ingredients` DISABLE KEYS */;
INSERT INTO `ingredients` (`id`, `ingredient`) VALUES
	(1, 'salt'),
	(2, 'milk'),
	(3, 'eggs'),
	(4, 'butter'),
	(5, 'sugar'),
	(6, 'flour'),
	(7, 'chicken'),
	(8, 'rice');
/*!40000 ALTER TABLE `ingredients` ENABLE KEYS */;

-- Dumping structure for table 3546_3547.recipe
CREATE TABLE IF NOT EXISTS `recipe` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `recipeName` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `recipeDescription` varchar(3500) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `code` varchar(3500) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=latin1;

-- Dumping data for table 3546_3547.recipe: ~5 rows (approximately)
/*!40000 ALTER TABLE `recipe` DISABLE KEYS */;
INSERT INTO `recipe` (`id`, `recipeName`, `recipeDescription`, `code`) VALUES
	(1, 'αυγό βραστό', 'Πρώτο βήμα: Βάλτε τα αυγά (πρέπει να είναι σε θερμοκρασία δωματίου) σε ένα κατσαρολάκι με κρύο νερό.', '1,3,'),
	(2, 'κρέπες', '1. Χτυπάμε καλά τα αβγά, προσθέτουμε το γάλα, το αλάτι, το αλεύρι και το βούτυρο. Σκεπάζουμε και αφήνουμε για 30 λεπτά.\r\n2.Σε αντικολλητικό τηγάνι βάζουμε μια μικρή ποσότητα της ζύμης (ίσα να καλύπτει το τηγάνι), και μόλις ψηθεί από κάτω, τη γυρίζουμε.\r\n3.Αφήνουμε για λίγο και από την άλλη και τη βγάζουμε από το τηγάνι.\r\n4.Μπορούμε να τη γεμίσουμε με ό,τι θέλουμε και ή να τη φάμε έτσι ή να τη βάλουμε στο φούρνο για να λιώσει η γέμιση.\r\n\r\n2 αβγά\r\n1 φλ. γάλα\r\n1/2 κ.γ. αλάτι\r\n1 φλ. αλεύρι\r\n2 κ.σ. λιωμένο βούτυρο ή μαργαρίνη ή λάδι\r\n\r\n', '1,2,3,4,6,'),
	(3, 'cake', 'Χτυπάτε το βούτυρο και ρίχνετε τμηματικά τη ζάχαρη και ένα – ένα τα αβγά. \r\nΣυνεχίζετε το χτύπημα για 3 λεπτά. Προσθέτετε διαδοχικά τη Φαρίνα ΓΙΩΤΗΣ με το γάλα και το άρωμα και ανακατεύετε ελαφρά.\r\n Βάζετε το μίγμα του κέικ σε 2 φόρμες 23x13 εκ. ή σε 2 στρογγυλές Νο 22 βουτυρωμένες και αλευρωμένες. \r\nΨήνετε σε μέτριο προθερμασμένο φούρνο για 1 ώρα. Αφήνετε για 10 λεπτά τα κέικ να κρυώσουν στις φόρμες.\r\n Ύστερα τα βάζετε σε πιατέλα και πασπαλίζετε με ζάχαρη άχνη.\r\n\r\n500 γρ. Φαρίνα ΓΙΩΤΗΣ\r\n250 γρ. (1 ½ φλιτζ. τσαγιού) βούτυρο ή μαργαρίνη\r\n440 γρ. (2 ½ φλιτζ. τσαγιού) ζάχαρη\r\n4-5 αβγά\r\n260 ml (1 ¼ φλιτζ. τσαγιού) γάλα', '2,3,4,5,6,'),
	(4, 'pancakes', '1) Χτυπάμε ελαφρά το γάλα με το αβγό και το βούτυρο. Αλλού ανακατεύουμε το αλεύρι, το μπέικιν, τη ζάχαρη και το αλάτι και τα προσθέτουμε στο πρώτο μείγμα, ανακατεύοντας ίσα ίσα να βραχεί το αλεύρι.\r\n2) Βουτυρώνουμε ελαφρά ένα τηγανάκι και ρίχνουμε μια δόση ζύμης. Εγώ βάζω συνήθως 2 κουταλιές σούπας, αλλά εξαρτάται από το μέγεθος του pancake που θέλετε. Μην το απλώσετε σαν κρέπα λεπτό, θέλει να έχει ένα πάχος.\r\n3) Το αφήνουμε να ψηθεί μέχρι να κάνει από πάνω τρύπες στη ζύμη (λίγο, σε 1-2 λεπτα το πολύ έχει γίνει). Να χαμηλώσετε τη φωτιά σας μετά το 2 pancake, για να μη σας καίγονται από κάτω.\r\n4) Το γυρίζουμε από την άλλη και το αφήνουμε για λίγο. Θα δείτε ότι γυρίζει εξαιρετικά εύκολα.\r\n5) Τα pancakes μας είναι έτοιμα. Μπορείτε να τα σερβίρετε με το ειδικό σιρόπι (maple syrup) ή με ό,τι άλλο θέλετε.\r\n\r\n3/4 φλ. γάλα\r\n2 κ.σ. λιωμένο βούτυρο (ή λαδάκι)\r\n1 αυγό\r\n1 φλ. άσπρο αλεύρι\r\n2 κ.γ. μπέικιν πάουντερ\r\n2 κ.σ. ζάχαρη  (ή και λιγότερη αν θέλετε να τα φάτε σε αλμυρή εκδοχή)\r\n1/2 κ.γ. αλάτι\r\n\r\n', '1,2,3,4,5,6,'),
	(5, 'κοτόπουλο με ρύζι', '"Βάλτε τα φιλέτα του κοτόπουλου σε ένα αντικολλητικό τηγάνι με λίγο νερό. Το νερό θα πρέπει να φτάνει λιγότερο από τη μέση των φιλέτων. Τα αφήνουμε να βράσει το νεράκι. Στο μεταξύ βάζουμε σε μια κατσαρόλα μια κ.σ. ελαιόλαδο και το ρύζι. Το ανακατεύουμε με μια κουτάλα να πάει το λαδάκι παντού και να ξανθύνει λίγο το ρύζι. Προσθέτουμε τη διπλάσια ποσότητα νερού (απ\' ό,τι ρύζι), βάζουμε λίγο αλάτι, ανακατεύουμε λίγο και αφήνουμε να βράσει. Τα φιλέτα μας θα πρέπει να βράζουν πλέον. Σκεπάζουμε το τηγάνι με ένα καπάκι και χαμηλώνουμε λίγο και τη φωτιά. Το ρύζι ΔΕΝ το ανακατεύουμε. Το αφήνουμε στην ησυχία του να βράσει. Θα δούμε πως θα κάνει "τρυπίτσες" από τις οποίες φεύγει ο ατμός. Το αφήνουμε έτσι (χωρίς να ανακατέψουμε είπαμε) μέχρι να δούμε πως από αυτές τις τρυπίτσες δε βλέπουμε καθόλου νεράκι πλέον. Τα φιλέτα μας μπορούμε να τα κόψουμε και στη μέση, ώστε να βράσουν λίγο πιο γρήγορα και να είμαστε και σίγουροι πως θα ψηθούν μέχρι μέσα. Το ζουμάκι θα είναι λίγο, δε μας πειράζει. Τα αφήνουμε σκεπασμένα να συνεχίσουν το βράσιμο. Προσέχουμε φυσικά να μη μείνουν εντελώς χωρίς υγρά. Εάν γίνει αυτό πριν βράσει το κοτόπουλο, τότε προσθέτουμε λίγο νεράκι. Όταν δούμε πως στο ρύζι μας δεν υπάρχει πλέον νεράκι καθόλου, σβήνουμε το μάτι, κλείνουμε το καπάκι. Θα το αφήσουμε έτσι για 5 λεπτά, μέχρι να γίνει και το κρέας μας. Όταν τα υγρά σωθούν και το κοτοπουλάκι μας βράσει, θα το αφήσουμε λίγο παραπάνω μέσα στο τηγάνι. Θα πάρει ένα ωραίο χρωματάκι. Το γυρνάμε και από τις δυο πλευρές. Δε θα το αφήσουμε να καεί, απλώς να ροδίσει λιγάκι. Κλείνουμε το μάτι, καθώς είναι έτοιμο. Ρίχνουμε από πάνω λίγο ελαιόλαδο, αλάτι και λίγο λεμόνι. Εάν δεν έχουμε πρόβλημα με την κοιλιά μας ρίχνουμε και ρίγανη και πιπέρι. Και το ρύζι μας είναι έτοιμο. Ανοίξτε την κατσαρόλα και ανακατέψτε. Θα δείτε πως είναι αφράτο και σπυρωτό. Το φαγητό μας είναι έτοιμο. Βάλτε σε ένα πιάτο ρύζι και λίγο κοτόπουλο και δείτε πόσο νόστιμο μπορεί να γίνει ένα τόσο απλό πιάτο.', '1,7,8,');
/*!40000 ALTER TABLE `recipe` ENABLE KEYS */;

-- Dumping structure for table 3546_3547.users
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(255) NOT NULL AUTO_INCREMENT,
  `userName` varchar(50) DEFAULT NULL,
  `userPassword` varchar(50) DEFAULT NULL,
  `typeOfUser` int(11) DEFAULT NULL,
  `IP` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=latin1;

-- Dumping data for table 3546_3547.users: ~0 rows (approximately)
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` (`id`, `userName`, `userPassword`, `typeOfUser`, `IP`) VALUES
	(1, 'alex', '3547', 2, '::1'),
	(2, 'antwnhs', '3546', 2, NULL),
	(3, 'admin', 'admin', 1, NULL),
	(7, 'test', 'test', 1, '::1'),
	(8, 'testuser', 'testuser', 1, '::1'),
	(9, 'panos', 'panos', 1, '::1');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
